---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetPropertyList.AddNewAssetPropertyInteger(System.Int32)
source: html/8e4a307d-c1cf-1b5b-f07f-145e9279d6f6.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyList.AddNewAssetPropertyInteger Method

Adds a new AssetPropertyInteger containing the input value to this list.

## Syntax (C#)
```csharp
public void AddNewAssetPropertyInteger(
	int value
)
```

## Parameters
- **value** (`System.Int32`) - The integer value to add.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The asset property is not editable.